# Taps
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'grep'
brew 'luarocks' # lua package manager
brew 'httpie'
brew 'jq' 
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'ripgrep'
brew 'stripe/stripe-cli/stripe'
brew 'svn' # Needed to install fonts
brew 'tmux'

# Development
brew 'imagemagick'

# Apps
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'loom'
cask 'pastebot'
cask 'slack'
cask 'tunnelbear'
cask 'tuple'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
