# Binaries
brew 'awk'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'eza' # A modern replacement for `ls`
brew 'fd'
brew 'fzf' # Fuzzy finder
brew 'gcc'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'glab'
brew 'grep'
brew 'luarocks' # lua package manager
brew 'httpie'
brew 'jq' 
brew 'make'
brew 'neovim'
brew 'nvm'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'ripgrep'
brew 'tmux'

# Development
# brew 'imagemagick'

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'
#
# Fonts
# brew 'svn' # Needed to install fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
